BookStore-Site/app/Controllers/AdminController.php

SELECT *
FROM `usuario`
WHERE `activo` = 1
AND `id_perfil` != 1
ORDER BY `id_usuario` ASC
---
public function listarClientes()
{
    $data['titulo'] = 'Lista de Clientes';
    echo view("templates/head.php", $data);
    echo view("templates/menuAdmin.php");

    // Me permite capturar la información y guardarla en la base de datos
    $usuarioModel = new UsuarioModel();

    // Asignamos un índice, ordenamos la información por id de forma ascendente y buscamos todos los registros
    // excepto aquellos con id_perfil igual a 1, y los depositamos en $datos['usuarios']
    $datos['usuarios'] = $usuarioModel->where('activo', 1)->where('id_perfil !=', 1)->orderBy('id_usuario', 'ASC')->findAll();