BookStore-Site/app/Controllers/carritoController.php

UPDATE `producto` SET `nombre` = 'Mientras escribo', `autor` = ' Stephen King', `descripcion` = 'Mientras escribo es un libro de Stephen King publicado en 2000. Es una autobiografía sobre las experiencias como escritor del prolífico autor, y también sirve como un libro-guía para aquellos que eligen dedicarse al oficio. ', `precioUni` = '2000.00', `imagen` = '1690258060_220446bc6c7cc84c349e.jpg', `stock` = 0, `stock_min` = '0', `activo` = '1', `id_categ` = '3'
WHERE `producto`.`id_prod` IN ('50')
---
       public function agregarCarrito() {

           $cart = \Config\Services::cart();
           $request = \Config\Services::request();
           $producto = new productoModel();

           $productId = $request->getPost('id');
           $product = $producto->find($productId);

           //si stock es mayor a 0
           if ($product['stock'] > 0) {
               // Restar 1 al stock del producto
               $newStock = $product['stock'] - 1;
               $product['stock'] = $newStock;
               $producto->update($productId, $product);

INSERT INTO `cabecera` (`total`, `id_usuario`, `fecha_alta`, `fecha_edit`) VALUES (2000, '52', '2023-08-01 01:40:38', '2023-08-01 01:40:38')
INSERT INTO `detalle` (`id_cabecera`, `id_prod`, `cantidad`, `precioUni`) VALUES (92, '50', 1, 2000)
---
   public function confirmarCompra()
   {
       $cart = \Config\Services::cart();
       $productos = $cart->contents();
       $session = session();
       $idUsuario = $session->get('id_usuario');
       $montoTotal = 0;

       foreach ($productos as $producto) {
           $montoTotal += $producto["subtotal"];
       }

       $ventaCabecera = new CabeceraModel();
       $idCabecera = $ventaCabecera->insert(["total" => $montoTotal, "id_usuario" => $idUsuario]);

       $ventaDetalle = new DetalleModel();
       $productoModel = new ProductoModel();

       foreach ($productos as $producto) {
           $ventaDetalle->insert([
               "id_cabecera" => $idCabecera,
               "id_prod" => $producto["id"],
               "cantidad" => $producto["qty"],
               "precioUni" => $producto["price"],

             ]);