BookStore-Site/app/Controllers/consultaController.php

public function listarConsulta()
{
    $data['titulo'] = 'Listar Productos';
    echo view("templates/head.php", $data);
    echo view("templates/menuAdmin.php");

    //me permite capturar la informacion y guardarla a la base de datos
    $consultaModel = new ConsultaModel();

    //le asignamos un indice,ordene la informacion de acuerdo al id, y de forma ascendente y que busque todos los registros
    //y depositar en $datos['productos']

    $datos['datos'] = $consultaModel->orderBy('id_consulta', 'ASC')->findAll();
---
SELECT *
FROM `consulta`
ORDER BY `id_consulta` ASC