BookStore-Site/app/Controllers/facturaController.php

SELECT *
FROM `cabecera`
WHERE `cabecera`.`id_cabecera` = '92'
SELECT *
FROM `detalle`
WHERE `id_cabecera` = '92'
SELECT *
FROM `usuario`
WHERE `usuario`.`id_usuario` = '52'
SELECT *
FROM `producto`
WHERE `producto`.`id_prod` = '50'
---
    public function mostrarCabeceraFactura($idCabecera)
    {

        $data['titulo'] = 'Listar Productos';
        echo view("templates/head.php", $data);
        echo view("templates/menu.php");


        $cabeceraModel = new CabeceraModel();
        $detalleModel = new DetalleModel();
        $usuarioModel = new UsuarioModel(); // Instanciar el modelo de Usuario
        $productoModel = new ProductoModel();

        // Obtén los datos de la cabecera de la factura por su ID
        $cabecera = $cabeceraModel->find($idCabecera);

        // Obtén los detalles de la factura relacionados con la cabecera por su ID de cabecera
        $detalle = $detalleModel->where('id_cabecera', $idCabecera)->findAll();

        // Obtén el nombre del usuario correspondiente al ID de usuario en la cabecera
        $usuario = $usuarioModel->find($cabecera['id_usuario']);
        $nombreUsuario = $usuario['nombre'] . ' ' . $usuario['apellido']; // Suponiendo que el nombre de usuario está en el campo 'nombre'

        // Obtén el nombre de cada producto en los detalles
    foreach ($detalle as &$item) {
    $producto = $productoModel->find($item['id_prod']);