BookStore-Site/app/Controllers/ProductoController.php

    public function listarProducto()
    {
        $data['titulo'] = 'Listar Productos';
        echo view("templates/head.php", $data);
        echo view("templates/menuAdmin.php");

        //me permite capturar la informacion y guardarla a la base de datos
        $productoModel = new ProductoModel();

        //le asignamos un indice,ordene la informacion de acuerdo al id, y de forma ascendente y que busque todos los registros
        //y depositar en $datos['productos']

        $datos['productos'] = $productoModel->where('activo', 1)->orderBy('id_prod', 'ASC')->findAll();
---
SELECT *
FROM `producto`
WHERE `activo` = 1
ORDER BY `id_prod` ASC

    public function catalogo2($id_categ = null)
    {



            $productoModel = new ProductoModel();
            $data['titulo'] = 'Catálogo';

            if ($id_categ) {
                // Si se proporciona una categoría, filtramos los productos por esa categoría
                $productos = $productoModel->where('id_categ', $id_categ)->findAll();
            } else {
                // Si no se proporciona una categoría, mostramos todos los productos
                $productos = $productoModel->findAll();
---
SELECT *
FROM `producto`