BookStore-Site/app/Controllers/UsuarioController.php

SELECT *
FROM `usuario`
WHERE `email` = 'ulisesabrahan858@gmail.com'
 LIMIT 1
---
    public function login() {
    $email = $this->request->getPost('email');
    $password = $this->request->getPost('password');

    // Instancio el modelo
    $model = new UsuarioModel();

    // Filtrar los registros de la tabla de usuarios, buscando aquellos que tengan el campo "email" igual al valor de la variable $email.
    $usuario = $model->where('email', $email)->first();