BookStore-Site/app/Controllers/ventaController.php

SELECT *
FROM `cabecera`
ORDER BY `id_cabecera` ASC
---
public function listarVentas()
{
    $data['titulo'] = 'Lista de ventas';

    echo view("templates/head.php", $data);
    echo view("templates/menuAdmin.php");
    //me permite capturar la informacion y guardarla a la base de datos
    $ventaModel = new CabeceraModel();

    //le asignamos un indice,ordene la informacion de acuerdo al id, y de forma ascendente y que busque todos los registros
    //y depositar en $datos['productos']

    $datos['datos'] = $ventaModel->orderBy('id_cabecera', 'ASC')->findAll();